app/Controllers/AlumnoController.php

SELECT *
FROM `alumnos`
SELECT COUNT(*) AS `numrows`
FROM `detalle_alumno_curso`
WHERE `alumno` = '3'
SELECT *
FROM `cursos`
---
    public function index()
    {
        $alumnoModel = new AlumnoModel();
        $cursoModel = new CursoModel();
        $detalleModel = new DetalleAlumnoCursoModel();

        $alumnos = $alumnoModel->findAll();

        foreach ($alumnos as &$alumno) {
            $cursosAsignados = $detalleModel->where('alumno', $alumno['alumno'])->countAllResults();
            $alumno['tiene_cursos'] = $cursosAsignados > 0;
            $alumno['total_cursos'] = $cursosAsignados;
        }

        $data['alumnos'] = $alumnos;
        $data['cursos'] = $cursoModel->findAll();

SELECT *
FROM `alumnos`
WHERE `alumnos`.`alumno` = '3'
---
    public function edit($id)
    {
        $data['alumno'] = $this->alumnoModel->find($id);

UPDATE `alumnos` SET `nombre` = 'Luis', `apellido` = 'Fernandez', `direccion` = 'Barrio el rastro', `movil` = '32182014', `email` = 'luis@gmail.com', `user` = 'admin', `inactivo` = '1'
WHERE `alumnos`.`alumno` IN ('3')
---
    public function update($id)
    {
        $this->alumnoModel->update($id, [
            'nombre'    => $this->request->getPost('nombre'),
            'apellido'  => $this->request->getPost('apellido'),
            'direccion' => $this->request->getPost('direccion'),
            'movil'     => $this->request->getPost('movil'),
            'email'     => $this->request->getPost('email'),
            'user'      => 'admin',
            'inactivo'  => $this->request->getPost('inactivo') ?? 0,
        ]);

DELETE FROM `detalle_alumno_curso`
WHERE `alumno` = '3'
---
    public function asignarCursos()
    {
        $alumno_pk = $this->request->getPost('alumno_id');
        $cursos = $this->request->getPost('cursos');

        $detalleModel = new DetalleAlumnoCursoModel();
        $detalleModel->where('alumno', $alumno_pk)->delete();

SELECT *
FROM `detalle_alumno_curso`
WHERE `alumno` = '3'
 LIMIT 1
SELECT `cursos`.`nombre`, `cursos`.`profesor`
FROM `detalle_alumno_curso`
INNER JOIN `cursos` ON `cursos`.`curso` = `detalle_alumno_curso`.`curso`
WHERE `detalle_alumno_curso`.`alumno` = '3'
AND `detalle_alumno_curso`.`inactivo` = 0
---
    public function verCursosAsignados($alumno_pk)
    {
        try {
            $detalleModel = new DetalleAlumnoCursoModel();


            $existe = $detalleModel->where('alumno', $alumno_pk)->first();

            if (!$existe) {
                return $this->response->setJSON([]);
            }


            $cursos = $detalleModel
                ->select('cursos.nombre, cursos.profesor')
                ->join('cursos', 'cursos.curso = detalle_alumno_curso.curso', 'inner')
                ->where('detalle_alumno_curso.alumno', $alumno_pk)
                ->where('detalle_alumno_curso.inactivo', 0)
                ->findAll();