app/Controllers/CursoController.php

    public function index()
    {
        $data['cursos'] = $this->cursoModel->findAll();
---
SELECT *
FROM `cursos`

    public function store()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nombre' => 'required|min_length[3]|max_length[100]|is_unique[cursos.nombre]',
            'profesor' => 'required|min_length[3]|max_length[100]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('validation', $validation);
        }

        $datos = [
            'nombre' => $this->request->getPost('nombre'),
            'profesor' => $this->request->getPost('profesor'),
            'inactivo' => 0,
        ];

        if ($this->cursoModel->save($datos)) {
---
INSERT INTO `cursos` (`nombre`, `profesor`, `inactivo`) VALUES ('Desarrollo Web', 'Walter Cordoba', 0)

    public function edit($id)
    {
        $data['curso'] = $this->cursoModel->find($id);
---
SELECT *
FROM `cursos`
WHERE `cursos`.`curso` = '3'

    public function update($id)
    {
        $this->cursoModel->update($id, [
            'nombre'   => $this->request->getPost('nombre'),
            'profesor' => $this->request->getPost('profesor'),
            'inactivo' => $this->request->getPost('inactivo') ?? 0,
        ]);
---
UPDATE `cursos` SET `nombre` = 'Desarrollo Web', `profesor` = 'Walter Cordoba', `inactivo` = '1'
WHERE `cursos`.`curso` IN ('3')