app/Models/DetalleAlumnoCursoModel.php

    public function insertDetalle($data)
    {
        $data['fecha_asignacion'] = date('Y-m-d H:i:s');
        $data['user'] = 'admin';
        $data['inactivo'] = 0;

        return $this->insert($data);
---
INSERT INTO `detalle_alumno_curso` (`alumno`, `curso`, `fecha_asignacion`, `user`, `inactivo`) VALUES ('3', '3', '2025-08-30 03:11:08', 'admin', 0)